In [1]:
import pandas as pd
import numpy as np

[Link](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html)

### Basics

##### Selecting Series will return a scalar value while selecting a DF will return a series corresponding to column name

In [3]:
s = pd.Series(np.random.randint(0, 10, 10))

In [3]:
s[0]

8

In [8]:
dates = pd.date_range('27/03/2020', periods=8, freq='D')
df = pd.DataFrame(np.random.randn(8, 4), columns=list('ABCD'), index=dates)

In [9]:
df['A']

2020-03-27   -1.774366
2020-03-28    1.098457
2020-03-29    0.967668
2020-03-30    0.082346
2020-03-31   -0.353369
2020-04-01    0.130922
2020-04-02    0.303847
2020-04-03    2.072334
Freq: D, Name: A, dtype: float64

In [13]:
s = df['A'] # a series

In [12]:
s['2020-03-30']

0.08234565132669065

In [15]:
df[['A', 'C']] # to select multiple columns

                   A         C
2020-03-27 -1.774366 -0.446361
2020-03-28  1.098457 -0.408654
2020-03-29  0.967668  2.465919
2020-03-30  0.082346  0.002045
2020-03-31 -0.353369  0.622119
2020-04-01  0.130922 -0.112837
2020-04-02  0.303847 -1.506554
2020-04-03  2.072334 -0.877143

In [19]:
df[['B', 'A']] = df[['A', 'B']] # para trocar os valores das colunas (in-place)

In [20]:
df

                   A         B         C         D
2020-03-27 -1.774366 -0.894074 -0.446361 -0.261157
2020-03-28  1.098457  0.217971 -0.408654 -0.674199
2020-03-29  0.967668  0.005486  2.465919  0.914875
2020-03-30  0.082346  1.175956  0.002045 -2.075220
2020-03-31 -0.353369 -0.823701  0.622119  0.172870
2020-04-01  0.130922 -0.519444 -0.112837  0.143884
2020-04-02  0.303847  0.541700 -1.506554  0.701098
2020-04-03  2.072334  0.838141 -0.877143 -1.354632

### Attribute Access

##### Para acessarmos valores de series e DFs como atributos (notação de ponto)

In [75]:
s = pd.Series(list(range(0,10)), index=list('abcdefghij'))

In [76]:
s.c

2

In [39]:
df.A

2020-03-27   -1.774366
2020-03-28    1.098457
2020-03-29    0.967668
2020-03-30    0.082346
2020-03-31   -0.353369
2020-04-01    0.130922
2020-04-02    0.303847
2020-04-03    2.072334
Freq: D, Name: A, dtype: float64

##### Para atribuirmos valores especificos

In [77]:
s.c = 4

In [78]:
s

a    0
b    1
c    4
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int64

In [79]:
s['a']

0

In [80]:
s['b']

1

In [64]:
# para atribuir novos valores a uma coluna ou para criar uma nova coluna
# nao eh possivel criar nova coluna com a notacao de ponto
df['A'] = list(range(len(df.index))) 
df

            A         B         C         D
2020-03-27  0 -0.894074 -0.446361 -0.261157
2020-03-28  1  0.217971 -0.408654 -0.674199
2020-03-29  2  0.005486  2.465919  0.914875
2020-03-30  3  1.175956  0.002045 -2.075220
2020-03-31  4 -0.823701  0.622119  0.172870
2020-04-01  5 -0.519444 -0.112837  0.143884
2020-04-02  6  0.541700 -1.506554  0.701098
2020-04-03  7  0.838141 -0.877143 -1.354632

In [81]:
# para atribuir novos valores para mais de uma coluna ao mesmo tempo use o dicionario
df.iloc[1] = {'A': 'oi', 'B': 3, 'C': np.nan, 'D': 5}
df

             A          B           C         D
2020-03-27   0  -0.894074   -0.446361 -0.261157
2020-03-28  oi          3         NaN         5
2020-03-29   2  0.0054856     2.46592  0.914875
2020-03-30   3    1.17596  0.00204503  -2.07522
2020-03-31   4  -0.823701    0.622119   0.17287
2020-04-01   5  -0.519444   -0.112837  0.143884
2020-04-02   6     0.5417    -1.50655  0.701098
2020-04-03   7   0.838141   -0.877143  -1.35463

### Slicing Ranges

##### Em series, fatiamento funciona exatamente como em um array, retornando a fatia indicada

In [82]:
s[:5]

a    0
b    1
c    4
d    3
e    4
dtype: int64

In [83]:
# selecao de todas as linhas pulando de 2 em 2
s[::2]

a    0
c    4
e    4
g    6
i    8
dtype: int64

In [84]:
# selecao de todas as linhas em ordem inversa
s[::-1]

j    9
i    8
h    7
g    6
f    5
e    4
d    3
c    4
b    1
a    0
dtype: int64

##### Atribuicao de valores tambem funciona dessa forma

In [85]:
# vamos copiar a serie "s" para trabalharmos com ela
s1 = s.copy()

In [89]:
s1[:5] = 0
s1

a    0
b    0
c    0
d    0
e    0
f    5
g    6
h    7
i    8
j    9
dtype: int64

##### Com dataframes, esses fatiamentos sempre serao fatiamento de linhas (rows)

In [91]:
df[:3]

             A          B         C         D
2020-03-27   0  -0.894074 -0.446361 -0.261157
2020-03-28  oi          3       NaN         5
2020-03-29   2  0.0054856   2.46592  0.914875

In [92]:
df[::-1]

             A          B           C         D
2020-04-03   7   0.838141   -0.877143  -1.35463
2020-04-02   6     0.5417    -1.50655  0.701098
2020-04-01   5  -0.519444   -0.112837  0.143884
2020-03-31   4  -0.823701    0.622119   0.17287
2020-03-30   3    1.17596  0.00204503  -2.07522
2020-03-29   2  0.0054856     2.46592  0.914875
2020-03-28  oi          3         NaN         5
2020-03-27   0  -0.894074   -0.446361 -0.261157

### Selection by label

##### Para fatiamento, ambos inicio e fim da fatia serão incluídos

In [143]:
s1 = s.copy()
s1.loc['a':'d'] # retornará uma serie que incluirá do ponto a até o ponto d

a    0
b    1
c    4
d    3
dtype: int64

##### Na notação .loc(), numeros inteiros sempre serão considerados como labels e jamais como índices de posição

In [203]:
s2 = pd.Series(list(range(0, 6)))

In [206]:
s2.loc[2] # Apesar de ser tambem indice, este numero 2 tem a função de label nessa chamada de .loc()

2

In [178]:
ss = pd.Series(np.random.randn(5), index=['2', '1', '3', '5', '4'])

In [179]:
ss

2    2.574165
1   -1.764159
3    1.259999
5    0.126101
4    0.103809
dtype: float64

In [175]:
ss.loc[1] # vai dar erro
ss.loc['1'] # label

0.5769592772459465

##### Tambem podemos usar .loc() para atribuir novos valores

In [182]:
s2 = pd.Series(np.random.randn(5), index=list('abcde'))

In [186]:
s2

a    1.470712
b    1.111330
c    0.444748
d    1.114121
e    0.214794
dtype: float64

In [193]:
s2.loc['c'] = 55

In [194]:
s2

a     1.470712
b     1.111330
c    55.000000
d     1.114121
e     0.214794
dtype: float64

##### Agora trabalhando com dataframe

In [215]:
df = pd.DataFrame(np.random.randn(6, 4), index=list('abcdef'), columns=list('ABCD'))
df

          A         B         C         D
a -0.024790  1.452911  1.067810  0.644974
b -0.815818 -1.886347 -1.096606 -2.281181
c -0.471540  2.470776  1.345111  1.590796
d  1.580715 -0.116506  1.253634 -1.655679
e  0.354027 -0.458352  1.680041  0.840221
f -0.213879 -0.365768  1.181094  1.127053

In [217]:
# para selecionar linhas ou colunas intercaladas, essas deverao ir dentro de listas
df.loc[['a', 'c', 'f'], 'A':'C']

          A         B         C
a -0.024790  1.452911  1.067810
c -0.471540  2.470776  1.345111
f -0.213879 -0.365768  1.181094

In [218]:
df.loc['c':, ['A', 'D']]

          A         D
c -0.471540  1.590796
d  1.580715 -1.655679
e  0.354027  0.840221
f -0.213879  1.127053

In [219]:
df.loc['b']

A   -0.815818
B   -1.886347
C   -1.096606
D   -2.281181
Name: b, dtype: float64

In [221]:
df.loc['a'] > 0 # para retornar valores booleanos

A    False
B     True
C     True
D     True
Name: a, dtype: bool

In [233]:
df.loc[:, df.loc['d'] > 0] # para retornar valores booleanos incluindo as colunas

          A         C
a -0.024790  1.067810
b -0.815818 -1.096606
c -0.471540  1.345111
d  1.580715  1.253634
e  0.354027  1.680041
f -0.213879  1.181094

In [235]:
df.loc['a', 'C'] # para retornar um valor explicito (com endereco de linha e coluna precisos)

1.0678103397383472

In [238]:
s = pd.Series(list('abcde'), index=[0, 3, 2, 5, 4])
s

0    a
3    b
2    c
5    d
4    e
dtype: object

In [240]:
s.loc[2:4] # fatiando com loc(), os endpoints sao inclusivos e, se existirem no indice, retornara os valores entre eles

2    c
5    d
4    e
dtype: object

In [242]:
s[2:4] # so para ilustrar, sem .loc() o endpoint final nao eh inclusivo

2    c
5    d
dtype: object

In [245]:
s = s.sort_index()

In [246]:
s

0    a
2    c
3    b
4    e
5    d
dtype: object

In [249]:
# se o indice estiver organizado e colocarmos labels inexistentes, os valores entre os endpoints serao selecionados
s.loc[1:6]

2    c
3    b
4    e
5    d
dtype: object

### Selection by Position

##### Com o metodo .iloc(), aceita somente numeros inteiros para selecionar valores

##### Diferente do metodo .loc(), a primeira ponta do fatiamento eh inclusiva enquanto a ultima ponta eh exclusiva

In [252]:
s1 = pd.Series(np.random.randn(5), index=list(range(0, 10, 2)))

In [253]:
s1

0   -0.443773
2   -1.308317
4    0.554686
6    0.667852
8    1.186758
dtype: float64

In [254]:
s1.iloc[:3]

0   -0.443773
2   -1.308317
4    0.554686
dtype: float64

In [259]:
# mesmo que o indice esteja em ordem numerica diferente, o metodo iloc se apega a ordem estrita dos indices
# como neste caso, o numero abaixo nao se refere ao label e sim a posição do indice
s1.iloc[3]

0.667852189928068

In [263]:
# eh possivel tambem atribuirmos valores
s1.iloc[:2] = 15
s1

0    15.000000
2    15.000000
4     0.554686
6     0.667852
8     1.186758
dtype: float64

##### Com dataframe

In [265]:
df1 = pd.DataFrame(np.random.randn(6,4), index=list(range(0, 12, 2)), columns=list(range(0, 8, 2)))

In [266]:
df1

           0         2         4         6
0   1.602745  0.344092 -0.370466 -0.363023
2   0.289616 -0.669883  0.482662 -2.096548
4   0.613613  1.004141  1.128239  0.082946
6  -0.318790  1.068618 -0.844685  0.063114
8   0.490023  0.101129 -1.096594  0.409039
10  1.710786 -1.152333 -1.203553 -0.683087

In [271]:
df1.iloc[2:]

           0         2         4         6
4   0.613613  1.004141  1.128239  0.082946
6  -0.318790  1.068618 -0.844685  0.063114
8   0.490023  0.101129 -1.096594  0.409039
10  1.710786 -1.152333 -1.203553 -0.683087

In [274]:
# para fatiar em linhas e colunas
df1.iloc[2:, 1:3]

           2         4
4   1.004141  1.128239
6   1.068618 -0.844685
8   0.101129 -1.096594
10 -1.152333 -1.203553

In [278]:
# para selecionar a partir de uma lista
df1.iloc[[1,3,5], [0,3]]

           0         6
2   0.289616 -2.096548
6  -0.318790  0.063114
10  1.710786 -0.683087

In [280]:
df1.iloc[:, 0:2] # para selecionar todas as linhas e fatiar as colunas
df1.iloc[[2,4], :] # para escolher linhas especificas e selecionar todas as colunas

          0         2         4         6
4  0.613613  1.004141  1.128239  0.082946
8  0.490023  0.101129 -1.096594  0.409039

In [286]:
# se usar fatiamento que esta fora do range vai retornar uma lista vazia, como seria numa lista python normal
df1.iloc[10:20,]

Empty DataFrame
Columns: [0, 2, 4, 6]
Index: []

In [288]:
# ja se for selecionar a partir de uma lista, qualquer indice que estiver fora do range vai retornar um traceback
# como no exemplo abaixo
df1.iloc[[10,20]]

### Selection by callable

##### .iloc, .loc e [ ] aceitam uma função como indexador para selecionar valores desejados

In [5]:
df1 = pd.DataFrame(np.random.randn(6,4), index=list('abcdef'), columns=list('ABCD'))

In [6]:
df1

          A         B         C         D
a -0.364507  0.707514 -0.922078  1.435909
b  0.653282 -0.482055 -0.102934  1.056913
c  0.509038 -1.812044 -0.336842  1.633412
d -1.021740  1.517621 -1.782818 -0.082229
e  1.849714  2.028928 -0.023797 -0.989763
f -0.934035  0.884102  0.003578  2.012263

In [7]:
df1.loc[lambda df: df['A'] > 0, :]

          A         B         C         D
b  0.653282 -0.482055 -0.102934  1.056913
c  0.509038 -1.812044 -0.336842  1.633412
e  1.849714  2.028928 -0.023797 -0.989763

In [8]:
df1.loc[:,lambda df: ['A', 'B']]

          A         B
a -0.364507  0.707514
b  0.653282 -0.482055
c  0.509038 -1.812044
d -1.021740  1.517621
e  1.849714  2.028928
f -0.934035  0.884102

In [10]:
df1.iloc[:, lambda df: [0, 1]]

          A         B
a -0.364507  0.707514
b  0.653282 -0.482055
c  0.509038 -1.812044
d -1.021740  1.517621
e  1.849714  2.028928
f -0.934035  0.884102

##### Podemos usar callables em series tambem

In [13]:
df1['A'].loc[lambda s: s > 0]

b    0.653282
c    0.509038
e    1.849714
Name: A, dtype: float64

### Selecting random samples

##### O metodo sample seleciona aleatoriamente uma linha do data set

In [21]:
s = pd.Series(np.arange(6))

In [34]:
s.sample() # para escolher 1 dado aleatorio

2    2
dtype: int32

In [52]:
s.sample(2) # para escolher 2 dados aleatorios diferentes

4    4
5    5
dtype: int32

In [53]:
s.sample(frac=0.50) # para escolher uma fração aleatoria do do dataset

2    2
5    5
1    1
dtype: int32

In [54]:
s.sample(6, replace=True) # com o argumento replace a amostra pode trazer numeros repetidos

5    5
1    1
3    3
3    3
3    3
1    1
dtype: int32

##### Por padrao, cada linha tem a mesma chance de ser selecionada. O argumento weights altera o peso para cada variavel

In [97]:
w = [0, 0.5, 0.1, 0.1, 0.2, 0.1] # 6 valores para um dataset de 6. Cada float representa uma porcentagem de chance
s.sample(5, weights=w)

1    1
4    4
5    5
2    2
3    3
dtype: int32

##### Aplicando aos dataframes, podemos usar valores aleatorios do dataset usando uma coluna de pesos como referencia

In [380]:
df = pd.DataFrame({'col1':[5, 2, 9], 'weight_column':[0.5, 0.3, 0.2]})
df

   col1  weight_column
0     5            0.5
1     2            0.3
2     9            0.2

In [388]:
df.sample(1, weights='weight_column')

   col1  weight_column
0     5            0.5

##### Com o argumento axis, podemos mudar a selecao aleatoria para as colunas

In [113]:
df3 = pd.DataFrame({'col1':[1, 2, 3], 'col2':[3, 5, 8], 'col3':[0, 3, 7]})

In [146]:
df3.sample(1, axis=1)

   col3
0     0
1     3
2     7

In [147]:
df3.sample(1) # sem o argumento

   col1  col2  col3
1     2     5     3

##### O argumento random_state seta uma seed para o gerador aleatorio de numeros
    Com uma seed declarada, a amostra sempre ira retornar os mesmos dados

In [174]:
df3.sample(2, random_state=2)

   col1  col2  col3
2     3     8     7
1     2     5     3

In [175]:
df3.sample(2, random_state=2)

   col1  col2  col3
2     3     8     7
1     2     5     3

### Fast scalar value getting and setting    
    Bem parecidos com iloc e loc, com a diferenca de que são mais ágeis para retornar valores escalares (unicos)

In [181]:
df = pd.DataFrame(np.random.randn(6,4), columns=list('ABCD'))

In [208]:
df

          A         B         C         D
0 -0.374970 -0.786874 -0.944638 -0.465695
1 -0.528314  0.332428 -1.305065 -1.104695
2  1.146375  0.564931  0.635820  0.521684
3  0.911086 -1.184516 -0.070385 -0.652893
4  0.987369  0.398062  0.350782  0.542382
5 -0.993480  2.532773  0.808487 -1.468874

In [212]:
df.iat[5, 3] # equivalente ao iloc

-1.4688744783754144

In [215]:
df.at[5, 'D'] # equivalente ao loc

-1.4688744783754144

### Boolean Indexing
    Uso de expressoes booleanas para filtrar os dados

In [228]:
s = pd.Series(range(-3,4)) # Vamos trabalhar com esta serie
s

0   -3
1   -2
2   -1
3    0
4    1
5    2
6    3
dtype: int64

In [227]:
# Expressoes compostas devem ser agrupadas entre parenteses
s[(s > -1) | (s > 0)]

3    0
4    1
5    2
6    3
dtype: int64

In [229]:
s[(s > -2) & (s < 1)]

2   -1
3    0
dtype: int64

In [232]:
df[df['A'] > 0] # filtrando um dataframe partindo de uma condicao booleana

          A         B         C         D
2  1.146375  0.564931  0.635820  0.521684
3  0.911086 -1.184516 -0.070385 -0.652893
4  0.987369  0.398062  0.350782  0.542382

In [233]:
# Criterios multiplos
df[(df['A'] > -1) & (df['B'] < -1)]

          A         B         C         D
3  0.911086 -1.184516 -0.070385 -0.652893

##### Podemos usar comprehension list e maps para produzir comparacoes mais complexas

In [389]:
df2 = pd.DataFrame({'a': ['one', 'one', 'two', 'three', 'two', 'one', 'six'], 
                    'b': ['x', 'y', 'y', 'x', 'y', 'x', 'x'], 'c': np.random.randn(7)})

In [390]:
# only want 'two' or 'three' - com a funcao map
df2[df2['a'].map(lambda x: x.startswith('t'))]

       a  b         c
2    two  y  0.504248
3  three  x  0.917905
4    two  y -0.883943

In [392]:
# equivalente acima usando a funcao apply
df2[df2['a'].apply(lambda x: x.startswith('t'))]

       a  b         c
2    two  y  0.504248
3  three  x  0.917905
4    two  y -0.883943

In [393]:
# mesma coisa agora utilizando list comprehension (metodo mais lento)
criterio = [x.startswith('t') for x in df2['a']]
df2[criterio]

       a  b         c
2    two  y  0.504248
3  three  x  0.917905
4    two  y -0.883943

In [394]:
# usando indexadores loc, iloc etc podemos selecionar por mais de um eixo e usando diferentes expressoes
df2.loc[(df2['b'] == 'x'), 'b':]

   b         c
0  x -0.602437
3  x  0.917905
5  x -1.388196
6  x -0.645879

### Indexing with isin
    Esta função retorna True para cada elemento da serie que existir na lista

In [264]:
s.isin([-3, 2, 0])

0     True
1    False
2    False
3     True
4    False
5     True
6    False
dtype: bool

In [265]:
s[s.isin([-3, 2, 0])]

0   -3
3    0
5    2
dtype: int64

In [268]:
# pode ser usada para procurar indices tambem. Util quando nao se sabe qual dos labels passados estao de fato presentes

s[s.index.isin([1, 2, 3, 10])]

1   -2
2   -1
3    0
dtype: int64

In [269]:
# compare o exemplo acima com a função reindex

s.reindex([1, 2, 3, 10])

1    -2.0
2    -1.0
3     0.0
10    NaN
dtype: float64

In [284]:
s_mi = pd.Series(list(range(6)), index=pd.MultiIndex.from_product([[0, 1], ['a', 'b', 'c']]))

In [309]:
# para multiindex, podemos selecionar por level
# todas as listas de argumentos devem sempre ficar entre colchetes
s_mi.loc[s_mi.index.isin([[0, 'b'], [1, 'c']])]

0  b    1
1  c    5
dtype: int64

In [313]:
# dessa forma abaixo, podemos escolher selecionar de apenas um level do multiindex
s_mi[s_mi.index.isin(['a', 'c'], level=1)]

0  a    0
   c    2
1  a    3
   c    5
dtype: int64

In [314]:
s_mi[s_mi.index.isin([1], level=0)]

1  a    3
   b    4
   c    5
dtype: int64

##### No caso de dataframes os mesmos principios funcionam, mas os dicionarios tbm sao aceitos para seleção de múltiplas colunas

In [75]:
df1 = pd.DataFrame({'vals':[1, 2, 3], 'id':['a', 'b', 'c'], 'id2':['z', 'y', 'x']})

In [76]:
values = {'vals':[1, 2], 'id':['a'], 'id2':['x']}
df1.isin(values)

    vals     id    id2
0   True   True  False
1   True  False  False
2  False  False   True

In [77]:
# para retornar um dataframe em vez de valores booleanos, so colocar a expressao dentro do dataframe
df1[df1.isin(values)]

   vals   id  id2
0   1.0    a  NaN
1   2.0  NaN  NaN
2   NaN  NaN    x

In [78]:
df1[df1['vals'].isin([1, 2])]

   vals id id2
0     1  a   z
1     2  b   y

In [80]:
# podemos usar os metodos any() e all() para selecionar somente valores que combinem com o criterio passado
# nesse caso, so retornara valores verdadeiros, valores Nan serao omitidos
values = {'id': ['a', 'b'], 'id2': ['z', 'y'], 'vals': [1, 3]}
row_mask = df1.isin(values).all(1)

df1[row_mask]

   vals id id2
0     1  a   z

In [81]:
# mesma situação acima, mas sem o método all()

row_mask1 = df1.isin(values)

df1[row_mask1]

   vals   id  id2
0   1.0    a    z
1   NaN    b    y
2   3.0  NaN  NaN

### The where() Method and Masking
    Esta função checa o dataframe a partir de uma ou mais condições e retorna o resultado desejado

In [411]:
s[s > 0] # aplicar uma expressao booleana pura traz apenas um subset da serie

4    1
5    2
6    3
dtype: int64

In [417]:
s.where(s > 0) # para retornar o mesmo tamanho do shape original usamos o metodo where

0    NaN
1    NaN
2    NaN
3    NaN
4    1.0
5    2.0
6    3.0
dtype: float64

In [424]:
# a selecao booleana de dataframe usa o metodo where embutido
# sendo assim, os 2 exemplos abaixo sao equivalentes
df.where(df > 0)
df[df > 0]

          A         B         C         D
0       NaN       NaN       NaN       NaN
1       NaN  0.332428       NaN       NaN
2  1.146375  0.564931  0.635820  0.521684
3  0.911086       NaN       NaN       NaN
4  0.987369  0.398062  0.350782  0.542382
5       NaN  2.532773  0.808487       NaN

In [431]:
# no entanto, o metodo where() aceita o argumento other para substituir valores que retornem Falso
# where() tambem aceita o parametro inplace caso deseja fazer uma modificação no dataset original
d = df.copy()
d.where(d > 0, other=5.5)

          A         B         C         D
0  5.500000  5.500000  5.500000  5.500000
1  5.500000  0.332428  5.500000  5.500000
2  1.146375  0.564931  0.635820  0.521684
3  0.911086  5.500000  5.500000  5.500000
4  0.987369  0.398062  0.350782  0.542382
5  5.500000  2.532773  0.808487  5.500000

##### Alignment

In [446]:
# where tambem aceita o argumento axis() para alinharmos onde sera a aplicada a condição

d.where(d > 0, d['A'], axis=0)

          A         B         C         D
0 -0.374970 -0.374970 -0.374970 -0.374970
1 -0.528314  0.332428 -0.528314 -0.528314
2  1.146375  0.564931  0.635820  0.521684
3  0.911086  0.911086  0.911086  0.911086
4  0.987369  0.398062  0.350782  0.542382
5 -0.993480  2.532773  0.808487 -0.993480

In [449]:
# where aceita callables como condições. A função deve possuir um argumento apenas

d.where(lambda x: x > 0, lambda x: d['A'], axis=0)

          A         B         C         D
0 -0.374970 -0.374970 -0.374970 -0.374970
1 -0.528314  0.332428 -0.528314 -0.528314
2  1.146375  0.564931  0.635820  0.521684
3  0.911086  0.911086  0.911086  0.911086
4  0.987369  0.398062  0.350782  0.542382
5 -0.993480  2.532773  0.808487 -0.993480

##### Mask
    Este é o inverso da operação booleana de where()
    Ela mascara os valores que cumpram com a condição

In [453]:
s.mask(s > 0)

0   -3.0
1   -2.0
2   -1.0
3    0.0
4    NaN
5    NaN
6    NaN
dtype: float64

In [455]:
# perceba a diferença
s.where(s > 0)

0    NaN
1    NaN
2    NaN
3    NaN
4    1.0
5    2.0
6    3.0
dtype: float64

### The query() Method
    Ajuda-nos a fazer uma selecao a partir de uma expressao

In [66]:
df = pd.DataFrame(np.random.rand(10, 3), columns=list('abc'))

##### Aqui, queremos selecionar as linhas onde 'b' eh maior e 'a' e menor que 'c'

In [67]:
# Usando python simples, temos:
df[(df['a'] < df['b']) & (df['b'] < df['c'])]

          a         b         c
2  0.091278  0.854083  0.931548
7  0.022568  0.841443  0.899695

In [69]:
# Agora usando o metodo query
df.query('a < b & b < c')

          a         b         c
2  0.091278  0.854083  0.931548
7  0.022568  0.841443  0.899695

In [28]:
# Podemos trabalhar usando expressoes diretamente com o indice tambem
df = pd.DataFrame(np.random.randint(5, size=(10, 2)), columns=list('bc'))
df.index.name = 'a'

In [29]:
df

   b  c
a
0  1  4
1  2  2
2  4  3
3  1  0
4  1  1
5  3  0
6  3  4
7  4  2
8  1  4
9  2  1

In [32]:
df.query('a < b and b < c')

   b  c
a
0  1  4

In [34]:
# Se preferir, ainda podemos usar o identificador 'index' no lugar do nome dado ao indice (ou se este nao for nomeado)
df.query('index < b and b < c')

   b  c
a
0  1  4

##### MultiIndex query() Syntax

In [46]:
n = 10
colors = np.random.choice(['red', 'green'], size=n)
foods = np.random.choice(['eggs', 'ham'], size=n)
index = pd.MultiIndex.from_arrays([colors, foods], names=['color', 'food'])
df = pd.DataFrame(np.random.randn(10, 2), index=index)

In [47]:
df

                   0         1
color food
green ham  -0.022683  0.601716
      ham   0.123444 -0.936273
      eggs -0.960799 -1.513395
      eggs  0.590007 -1.002713
      eggs -0.746062  0.426128
      ham   0.444886 -0.383484
      eggs  0.197790 -0.045150
red   ham  -1.027797 -1.309474
green ham  -1.274637  0.566571
red   eggs -0.943683  0.560634

In [54]:
df.query("food == 'ham'")

                   0         1
color food
green ham  -0.022683  0.601716
      ham   0.123444 -0.936273
      ham   0.444886 -0.383484
red   ham  -1.027797 -1.309474
green ham  -1.274637  0.566571

In [63]:
# Se o multi-indice nao estiver nomeado, podemos usar a nomenclatura especial para referencia
df.index.names = [None, None]
df.query("ilevel_1 == 'ham'")

                  0         1
green ham -0.022683  0.601716
      ham  0.123444 -0.936273
      ham  0.444886 -0.383484
red   ham -1.027797 -1.309474
green ham -1.274637  0.566571

##### query() Use Cases

In [70]:
# Podemos usar este metodo query quando temos dataframes diferentes com nomes de colunas em comum
# Dessa forma, eh possivel aplicar uma expressao unica para os dois DFs ao mesmo tempo
df1 = pd.DataFrame(np.random.rand(10, 3), columns=list('abc'))
df2 = pd.DataFrame(np.random.rand(12, 3), columns=df1.columns)

In [73]:
expr = "0.0 <= a <= c <= 0.5"

In [75]:
map(lambda frame: frame.query(expr), [df1, df2])

##### query() Python versus pandas Syntax Comparison

In [77]:
df[(df['a'] < df['b']) & (df['b'] < df['c'])]

          a         b         c
2  0.091278  0.854083  0.931548
7  0.022568  0.841443  0.899695

In [80]:
# Com ou sem parenteses, a expressao eh valida da mesma forma (sempre usando os operadores & |)
df.query("(a < b) & (b < c)")
df.query("a < b & b < c")

          a         b         c
2  0.091278  0.854083  0.931548
7  0.022568  0.841443  0.899695

In [84]:
# Podemos usar ingles em vez de simbolos
df.query("a < b and b < c")

          a         b         c
2  0.091278  0.854083  0.931548
7  0.022568  0.841443  0.899695

In [85]:
# Ou ainda essa expressao abaixo ainda eh valida
df.query("a < b < c")

          a         b         c
2  0.091278  0.854083  0.931548
7  0.022568  0.841443  0.899695

##### The in and not in operators
    Os operadores "in" e "not in" sao uma forma sucinta do uso de "isin"

In [86]:
df = pd.DataFrame({'a':list('aabbccddeeff'), 'b':list('aaaabbbbcccc'), 
                   'c':np.random.randint(5, size=12), 'd':np.random.randint(9, size=12)})

In [87]:
df

    a  b  c  d
0   a  a  4  1
1   a  a  1  7
2   b  a  3  8
3   b  a  2  2
4   c  b  0  7
5   c  b  2  6
6   d  b  2  6
7   d  b  3  1
8   e  c  2  2
9   e  c  4  3
10  f  c  2  4
11  f  c  3  2

In [88]:
df.query('a in b')

   a  b  c  d
0  a  a  4  1
1  a  a  1  7
2  b  a  3  8
3  b  a  2  2
4  c  b  0  7
5  c  b  2  6

In [90]:
# A expressao acima feita em puro python 
df[df['a'].isin(df['b'])]

   a  b  c  d
0  a  a  4  1
1  a  a  1  7
2  b  a  3  8
3  b  a  2  2
4  c  b  0  7
5  c  b  2  6

In [91]:
df.query('a not in b')

    a  b  c  d
6   d  b  2  6
7   d  b  3  1
8   e  c  2  2
9   e  c  4  3
10  f  c  2  4
11  f  c  3  2

In [93]:
df[~df['a'].isin(df['b'])]

    a  b  c  d
6   d  b  2  6
7   d  b  3  1
8   e  c  2  2
9   e  c  4  3
10  f  c  2  4
11  f  c  3  2

In [94]:
# podemos usar expressoes combinadas 
df.query('a in b and c < d')

   a  b  c  d
1  a  a  1  7
2  b  a  3  8
4  c  b  0  7
5  c  b  2  6

In [98]:
df[df['a'].isin(df['b']) & (df['c'] < df['d'])]

   a  b  c  d
1  a  a  1  7
2  b  a  3  8
4  c  b  0  7
5  c  b  2  6

##### Special use of the == operator with list objects
    Usando operadores com listas

In [99]:
df.query("b == ['a', 'b', 'c']")

    a  b  c  d
0   a  a  4  1
1   a  a  1  7
2   b  a  3  8
3   b  a  2  2
4   c  b  0  7
5   c  b  2  6
6   d  b  2  6
7   d  b  3  1
8   e  c  2  2
9   e  c  4  3
10  f  c  2  4
11  f  c  3  2

In [101]:
# O mesmo acima em puro python
df[df['b'].isin(['a', 'b', 'c'])]

    a  b  c  d
0   a  a  4  1
1   a  a  1  7
2   b  a  3  8
3   b  a  2  2
4   c  b  0  7
5   c  b  2  6
6   d  b  2  6
7   d  b  3  1
8   e  c  2  2
9   e  c  4  3
10  f  c  2  4
11  f  c  3  2

In [102]:
df.query('c == [1, 2]')

    a  b  c  d
1   a  a  1  7
3   b  a  2  2
5   c  b  2  6
6   d  b  2  6
8   e  c  2  2
10  f  c  2  4

In [110]:
df.query('[1, 2] in c')

    a  b  c  d
1   a  a  1  7
3   b  a  2  2
5   c  b  2  6
6   d  b  2  6
8   e  c  2  2
10  f  c  2  4

In [103]:
# o mesmo acima em puro python
df[df['c'].isin([1, 2])]

    a  b  c  d
1   a  a  1  7
3   b  a  2  2
5   c  b  2  6
6   d  b  2  6
8   e  c  2  2
10  f  c  2  4

In [108]:
# a possibilidade contrária de logica tambem eh valida
df.query('c != [1, 2]')

    a  b  c  d
0   a  a  4  1
2   b  a  3  8
4   c  b  0  7
7   d  b  3  1
9   e  c  4  3
11  f  c  3  2

In [105]:
df.query('[1, 2] not in c')

    a  b  c  d
0   a  a  4  1
2   b  a  3  8
4   c  b  0  7
7   d  b  3  1
9   e  c  4  3
11  f  c  3  2

##### Boolean operators

In [114]:
dff = pd.DataFrame(np.random.rand(10, 3), columns=list('abc'))

In [115]:
dff['bools'] = np.random.rand(len(dff)) > 0.5

In [117]:
dff.query('bools')

          a         b         c  bools
0  0.755290  0.076668  0.415298   True
1  0.151463  0.077416  0.279696   True
2  0.548144  0.962983  0.021544   True
3  0.404207  0.632870  0.907914   True
4  0.029623  0.071873  0.547316   True
5  0.693593  0.631906  0.295049   True
6  0.397974  0.193452  0.030140   True

In [120]:
# podemos negar expressoes booleanas com os simbolos "~" ou "not"
dff.query('~bools')

          a         b         c  bools
7  0.656858  0.705551  0.092016  False
8  0.851091  0.713951  0.760742  False
9  0.066160  0.434128  0.787286  False

In [121]:
dff.query('not bools')

          a         b         c  bools
7  0.656858  0.705551  0.092016  False
8  0.851091  0.713951  0.760742  False
9  0.066160  0.434128  0.787286  False

In [131]:
# podemos usar expressoes mais complexas tambem
simples = dff.query('a < b < c and (not bools) or bools > 2')
simples

         a         b         c  bools
9  0.06616  0.434128  0.787286  False

In [132]:
# agora escrito em puro python
complicada = dff[(dff['a'] < dff['b']) & (dff['b'] < dff['c']) & (~dff['bools']) | (dff['bools'] > 2)]
complicada

         a         b         c  bools
9  0.06616  0.434128  0.787286  False

In [133]:
simples == complicada

      a     b     c  bools
9  True  True  True   True

In [134]:
# provavelmente nunca usaremos expressoes como as de cima
# mas os exemplos mostram como podemos agregar expressoes diferentes

### Duplicate Data
    Usaremos os metodos "duplicated" e "drop_duplicates" para identificar e remover duplicatas

In [135]:
df2 = pd.DataFrame({'a':['one', 'one', 'two', 'two', 'two', 'three', 'four'], 
                    'b':['x', 'y', 'x', 'y', 'x', 'x', 'x'], 'c':np.random.randn(7)})

In [136]:
df2

       a  b         c
0    one  x  0.843888
1    one  y  1.159298
2    two  x -2.218507
3    two  y -0.198949
4    two  x -0.107825
5  three  x  0.732742
6   four  x -0.530847

In [159]:
# nesta forma, mostramos todos os valores duplicados exceto para a primeira ocorrencia
# o valor default para o parametro keep eh "first", por isso podemos omitir neste caso
df2.duplicated('a')

0    False
1     True
2    False
3     True
4     True
5    False
6    False
dtype: bool

In [160]:
# caso queiramos mostrar o dataframe em vez de valores booleanos
df2[df2.duplicated('a')]

     a  b         c
1  one  y  1.159298
3  two  y -0.198949
4  two  x -0.107825

In [157]:
# com o parametro keep para "last", mostra-se todos os valores duplicados exceto o ultimo valor
df2.duplicated('a', keep='last')

0     True
1    False
2     True
3     True
4    False
5    False
6    False
dtype: bool

In [158]:
# com o parametro keep para False, mostra-se todas os valores que estao duplicados

df2.duplicated('a', keep=False)

0     True
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [161]:
# se quisermos excluir os valores duplicados, basta usar o metodo "drop_duplicates"
# o metodo abaixo elimina as duplicatas e conserva a primeira ocorrencia
df2.drop_duplicates('a')

       a  b         c
0    one  x  0.843888
2    two  x -2.218507
5  three  x  0.732742
6   four  x -0.530847

In [162]:
# se quisermos eliminar as duplicatas, mas manter as ultimas ocorrencia
df2.drop_duplicates('a', keep='last')

       a  b         c
1    one  y  1.159298
4    two  x -0.107825
5  three  x  0.732742
6   four  x -0.530847

In [164]:
# neste exemplo eliminamos todas as ocorrencias de duplicatas
df2.drop_duplicates('a', keep=False)

       a  b         c
5  three  x  0.732742
6   four  x -0.530847

In [166]:
# podemos passar uma lista para verificarmos duplicatas em mais de uma coluna
df.duplicated(['a', 'b'])

0     False
1      True
2     False
3      True
4     False
5      True
6     False
7      True
8     False
9      True
10    False
11     True
dtype: bool

In [167]:
df2.drop_duplicates(['a', 'b'])

       a  b         c
0    one  x  0.843888
1    one  y  1.159298
2    two  x -2.218507
3    two  y -0.198949
5  three  x  0.732742
6   four  x -0.530847

In [168]:
# podemos aplicar este metodo para indices tambem
# as opcoes do parametro keep tambem sao validas para este caso

df3 = pd.DataFrame({'a':np.arange(6), 'b':np.random.randn(6)}, index=['a', 'a', 'b', 'c', 'b', 'a'])

In [171]:
df3.index.duplicated()

array([False,  True, False, False,  True,  True])

In [177]:
# para retornar a primeira ocorrencia de cada indice
df3[~df3.index.duplicated()]

   a         b
a  0 -0.249768
b  2  0.538049
c  3  0.795823

In [174]:
df3

   a         b
a  0 -0.249768
a  1  0.562132
b  2  0.538049
c  3  0.795823
b  4  0.789959
a  5  0.264221

### Dictionary-like get() method
    Eh um metodo equivalente a nomenclatura de colchetes --> df['']

In [178]:
s = pd.Series([1, 2, 3], index=['a', 'b', 'c'])

In [181]:
s.get('a') # equivalente a s['a']

1

### The lookup() method
    Quando queremos selecionar valores seguidos combinando uma sequencia especifica de rows e colunas

In [203]:
df = pd.DataFrame(np.random.rand(20, 4), columns=list('ABCD'))

In [204]:
df

           A         B         C         D
0   0.225831  0.302260  0.166254  0.192481
1   0.588378  0.910099  0.630188  0.494627
2   0.889876  0.689028  0.334552  0.777037
3   0.469165  0.015671  0.400338  0.612680
4   0.380597  0.327464  0.328427  0.174553
5   0.598377  0.319615  0.868882  0.339301
6   0.494704  0.832068  0.865919  0.487576
7   0.356060  0.070568  0.241992  0.139280
8   0.011172  0.650223  0.306563  0.643280
9   0.180378  0.511002  0.445495  0.199378
10  0.713561  0.286174  0.721453  0.819614
11  0.815260  0.456349  0.478496  0.672570
12  0.402824  0.861956  0.480061  0.647029
13  0.806453  0.452293  0.220566  0.995253
14  0.778119  0.962708  0.391777  0.055583
15  0.170942  0.311702  0.146100  0.603244
16  0.137946  0.361658  0.606248  0.571147
17  0.831875  0.026388  0.727628  0.247195
18  0.622401  0.210543  0.111402  0.944185
19  0.185085  0.750058  0.894394  0.954493

In [213]:
# a posição de cada lista se combina para buscar o valor desejado
# linha 12 da coluna A, linha 1 da coluna C etc...
df.lookup([12, 1, 10, 3, 19], ['A', 'C', 'D', 'B', 'A'])

array([0.40282382, 0.63018788, 0.81961441, 0.01567106, 0.18508473])

### Index objects

In [216]:
# a maneira mais facil de criar um indice eh passar uma lista ou outra sequencia para Index
index = pd.Index(['e', 'd', 'b', 'c', 'a'])
index

Index(['e', 'd', 'b', 'c', 'a'], dtype='object')

In [220]:
# podemos tambem atribuir um nome para o indice
index = pd.Index(['e', 'd', 'b', 'c', 'a'], name='nome qualquer')
index

Index(['e', 'd', 'b', 'c', 'a'], dtype='object', name='nome qualquer')

In [221]:
# uma vez atribuidos, os nomes serao exibidos
index = pd.Index(list(range(5)), name='rows')
columns = pd.Index(['A', 'B', 'C'], name='cols')

In [224]:
df = pd.DataFrame(np.random.randn(5, 3), index=index, columns=columns)
df

cols         A         B         C
rows
0    -0.748538  0.463699  1.238310
1    -0.277393 -0.367331 -0.933679
2     1.981988  0.893513  1.067419
3    -0.925764  0.518538  0.626236
4    -0.212956  0.236912  0.506414

In [225]:
df['A']

rows
0   -0.748538
1   -0.277393
2    1.981988
3   -0.925764
4   -0.212956
Name: A, dtype: float64

##### Setting metadata
    Podemos atribuir diretamente nomes de indices e multiindices com os metodos abaixo:
    
        - rename
        - set_names
        - set_levels
        - set_codes
        
    Especifique "inplace=True" para alterar permanentemente

In [235]:
ind = pd.Index([1, 2, 3, 4])

In [236]:
ind.rename('apple')

Int64Index([1, 2, 3, 4], dtype='int64', name='apple')

In [237]:
ind.set_names(['orange'], inplace=True)

In [238]:
ind

Int64Index([1, 2, 3, 4], dtype='int64', name='orange')

In [239]:
ind.name = 'melon'

In [240]:
ind

Int64Index([1, 2, 3, 4], dtype='int64', name='melon')

In [245]:
# podemos trabalhar tambem com multiindices
index = pd.MultiIndex.from_product([[0, 4, 5], ['one', 'two']], names=['first', 'second'])

In [246]:
index

MultiIndex(levels=[[0, 4, 5], ['one', 'two']],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [252]:
index.levels[1]

Index(['one', 'two'], dtype='object', name='second')

In [253]:
index.set_levels(['a', 'b'], level=1)

MultiIndex(levels=[[0, 4, 5], ['a', 'b']],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [256]:
index.set_levels(['zeka', 'jao', 'beto'], level=0)

MultiIndex(levels=[['zeka', 'jao', 'beto'], ['one', 'two']],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

##### Set operations on Index objects
    
    União = |
    Interseção = &  
    Diferença = .difference()

In [257]:
a = pd.Index(['c', 'b', 'a'])
b = pd.Index(['c', 'e', 'd'])

In [267]:
# a uniao com b
a | b

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [268]:
# a intersecao com b
a & b

Index(['c'], dtype='object')

In [269]:
# a diferenca entre a e b. Ou seja, o que tem em a que nao tem em b
a.difference(b)

Index(['a', 'b'], dtype='object')

##### Diferenca simetrica eh quando tem elementos que tem em um ou em outro conjunto, mas nao em ambos

In [270]:
idx1 = pd.Index([1, 2, 3, 4])
idx2 = pd.Index([2, 3, 4, 5])

In [271]:
idx1 ^ idx2

Int64Index([1, 5], dtype='int64')

In [272]:
idx1.symmetric_difference(idx2)

Int64Index([1, 5], dtype='int64')

##### Missing values

index.fillna() preenche os valores nulos do indice com o valor especificado

In [273]:
idx1 = pd.Index([1, np.nan, 3, 4])
idx1

Float64Index([1.0, nan, 3.0, 4.0], dtype='float64')

In [278]:
idx1.fillna(2)

Float64Index([1.0, 2.0, 3.0, 4.0], dtype='float64')

In [279]:
idx1

Float64Index([1.0, nan, 3.0, 4.0], dtype='float64')

In [280]:
idx2 = pd.Index([pd.Timestamp('2020-01-01'), pd.Timestamp('2020-01-02'), pd.NaT])

In [281]:
idx2

DatetimeIndex(['2020-01-01', '2020-01-02', 'NaT'], dtype='datetime64[ns]', freq=None)

In [282]:
idx2.fillna(pd.Timestamp('2020-01-03'))

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03'], dtype='datetime64[ns]', freq=None)

### Set / reset index
    O metodo set_index() usa coluna do dataframe para ser fixada como indice
    Eh possivel usar uma coluna para indice simples ou mais colunas para multiindice

In [332]:
data = pd.DataFrame({'a':['bar', 'bar', 'foo', 'foo'], 'b':['one', 'two'] * 2, 
                     'c':['z', 'y', 'x', 'w'], 'd':[1, 2, 3, 4]})

In [311]:
data

     a    b  c  d
0  bar  one  z  1
1  bar  two  y  2
2  foo  one  x  3
3  foo  two  w  4

In [312]:
# para fixar um indice simples
data.set_index('c')

     a    b  d
c
z  bar  one  1
y  bar  two  2
x  foo  one  3
w  foo  two  4

In [300]:
# para fixar um multiindice
data.set_index(['a', 'b'])

         c  d
a   b
bar one  z  1
    two  y  2
foo one  x  3
    two  w  4

In [298]:
# com o argumento drop, perceba que a coluna usada para indice eh preservada
data.set_index('c', drop=False)

     a    b  c  d
c
z  bar  one  z  1
y  bar  two  y  2
x  foo  one  x  3
w  foo  two  w  4

In [333]:
# o argumento append permite que preservemos o indice anterior e adicionemos um novo indice (ou multiindice)
frame = data.set_index('c')
frame.set_index('a', append=True)

         b  d
c a
z bar  one  1
y bar  two  2
x foo  one  3
w foo  two  4

In [319]:
# o argumento inplace pode ser usado para mudanca permanente no dataset
data.set_index('c', inplace=True)

In [315]:
data

     a    b  d
c
z  bar  one  1
y  bar  two  2
x  foo  one  3
w  foo  two  4

##### Reset the index
    Serve exatamente para resetar o indice estabelecendo o padrao de numeros inteiros no indice

In [321]:
data.reset_index()

   c    a    b  d
0  z  bar  one  1
1  y  bar  two  2
2  x  foo  one  3
3  w  foo  two  4

In [334]:
# podemos usar o argumento level para, no caso de multiindice, especificar qual indice deve ser retirado
frame = frame.set_index(['a', 'b'], append=True)

In [335]:
frame

           d
c a   b
z bar one  1
y bar two  2
x foo one  3
w foo two  4

In [337]:
# neste caso temos 3 niveis: 0 ('c'), 1 ('a'), 2 ('b')
frame.reset_index(level=0)

         c  d
a   b
bar one  z  1
    two  y  2
foo one  x  3
    two  w  4

In [340]:
# o parametro "drop" do metodo reset_index() descarta o indice sem coloca-lo de volta como coluna
frame.reset_index(level=0, drop=True)

         d
a   b
bar one  1
    two  2
foo one  3
    two  4

##### Adding an ad hoc index

In [349]:
# para modificar diretamente o indice
indice = ['w', 'x', 'y', 'z']
data.index = indice

### Returning a view versus a copy

In [343]:
dfmi = pd.DataFrame([list('abcd'), list('efgh'), list('ijkl'), list('mnop')], 
                    columns=pd.MultiIndex.from_product([['one', 'two'], ['first', 'second']]))

In [344]:
dfmi

    one          two
  first second first second
0     a      b     c      d
1     e      f     g      h
2     i      j     k      l
3     m      n     o      p

Ao atribuir valores especificos devemos evitar usar o modo "chained indexing" e preferir acessar com .loc() / .iloc()

In [361]:
# nunca devemos usar atribuicao de valores dessa forma
# alem de ser mais lento, o resultado eh imprevisivel e pode levantar erro
dfmi['one']['first'] = 1

c:\python\python37\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [368]:
# essa eh a maneira correta. Aplica-se para loc() e para iloc()
dfmi.loc[:, ('one', 'first')] = 1

In [369]:
dfmi

    one          two
  first second first second
0     1      b     c      d
1     1      f     g      h
2     1      j     k      l
3     1      n     o      p

In [371]:
dados = pd.DataFrame({'1un':[4, 2, 8], '2un':[10, 4, 9], '3un':[3, 8, 1], '4un':[0, 4, 9]}, index=['kaio', 'jao', 'zeka'])

In [372]:
dados

      1un  2un  3un  4un
kaio    4   10    3    0
jao     2    4    8    4
zeka    8    9    1    9

In [378]:
dados.loc['kaio'] = {'1un':10, '2un':7, '3un':9, '4un':8}

In [379]:
dados

      1un  2un  3un  4un
kaio   10    7    9    8
jao     2    4    8    4
zeka    8    9    1    9